#Когда первый раз пушим проект в гитхаб

git init # Для инициализации пустого репозитория
git add . # Для добавления всех файлов в репозитории 
git commit -m "Сообщение для коммитера" # Для коммитера


#Для добавления репозитория в гитхаб

git remote add origin ссылка #ссылка создается после создания репозитория

git push -u origin master # Для пуша в гидхаб




#Когда нужно отправить новое изменение в гитхаб

git add . #Для добавления всех файлов в репозиторий
git commit -m "Сообщение для коммитера" # Для коммитера
git push -u origin master # Для пуша в github




from os import system # Автоматически очищает терминал
system("clear")